---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArrArray.#ctor
source: html/8b04fd36-e926-ef82-54fc-849193f91bc3.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray.#ctor Method

Initializes a new instance of the ModelCurveArrArray class

## Syntax (C#)
```csharp
public ModelCurveArrArray()
```